from telegram import Update, InlineKeyboardButton, InlineKeyboardMarkup
from telegram.ext import Updater, CommandHandler, CallbackQueryHandler, CallbackContext
import random

words = {
    "аэропОрты": "аэрОпорты",
    "бАнты": "бантЫ",
    "бОроду": "борОду",
    "бухгАлтеров": "бухгалтерОв",
    "вероисповЕдание": "вероисповедАние",
    "водопровОд": "водопрОвод",
    "газопровОд": "газопрОвод",
    "граждАнство": "грАжданство",
    "дефИс": "дЕфис",
    "дешевИзна": "дешевизнА",
    "диспансЕр": "диспАнсер",
    "договорЕнность": "дОговоренность",
    "докумЕнт": "докУмент",
    "досУг": "дОсуг",
    "еретИк": "Еретик",
    "жалюзИ": "жАлюзи",
    "знАчимость": "значИмость",
    "Иксы": "иксЫ",
    "каталОг": "кАталог",
    "квартАл": "квАртал",
    "киломЕтр": "кИлометр",
    "кОнусов": "конусОв",
    "корЫсть": "кОрысть",
    "крАны": "кранЫ",
    "кремЕнь": "крЕмень",
    "лЕкторов": "лектОров",
    "лОктя": "локтЯ",
    "лыжнЯ": "лЫжня",
    "мЕстностей": "местностЕй",
    "намЕрение": "намерЕние",
    "нарОст": "нАрост",
    "нЕдруг": "недрУг",
    "недУг": "нЕдуг",
    "некролОг": "некрОлог",
    "нЕнависть": "ненавИсть",
    "нефтепровОд": "нефтепрОвод",
    "новостЕй": "новостИ",
    "нОгтя": "ногтЯ",
    "Отзыв (на сайте)": "отзЫв (на сайте)",
    "отзЫв (войск)": "Отзыв (войск)",
    "Отрочество": "отрОчество",
    "партЕр": "пАртер",
    "портфЕль": "пОрфель",
    "пОручни": "порУчни",
    "придАное": "прИданое",
    "призЫв": "прИзыв",
    "свекла": "свеклА",
    "сирОты": "сИроты",
    "созЫв": "сОзыв",
    "сосредотОчение": "сосредоточЕние",
    "срЕдства": "средствА",
    "стАтуя": "статУя",
    "столЯр": "стОляр",
    "тамОжня": "тАможня",
    "тОрты": "тортЫ",
    "тУфля": "туфлЯ",
    "цемЕнт": "цЕмент",
    "цЕнтнер": "центнЕр",
    "цепОчка": "цЕпочка",
    "шАрфы": "шарфЫ",
    "шофер": "шОфер",
    "экспЕрт": "Эксперт",
    "вернА": "вЕрна",
    "знАчимый": "значИмый",
    "красИвее": "красивЕе",
    "кУхонный": "кухОнный",
    "ловкА": "лОвка",
    "мозаИчный": "мозАичный",
    "оптОвый": "Оптовый",
    "прозорлИвый": "прозОрливый",
    "прозорлИва": "прозорливА",
    "слИвовый": "сливовЫй",
    "бралА": "брАла",
    "бралАсь": "брАлась",
    "взялА": "взЯла",
    "взялАсь": "взЯлась",
    "влилАсь": "влИлась",
    "ворвалАсь": "ворвАлась",
    "воспринялА": "воспрИняла",
    "воссоздалА": "воссоздАла",
    "вручИт": "врУчит",
    "гналА": "гнАла",
    "гналАсь": "гнАлась",
    "добралА": "дОбрала",
    "добралАсь": "дОбралась",
    "дождалАсь": "дождАлась",
    "дозвонИтся": "дозвОнится",
    "дозИровать": "дозировАть",
    "ждалА": "ждАла",
    "жилОсь": "жИлось",
    "закУпорить": "закупОрить",
    "зАнял": "занЯл",
    "занялА": "зАняла",
    "заперлА": "запЕрла",
    "запломбировАть": "запломбИровать",
    "защемИт": "защЕмит",
    "звалА": "звАла",
    "звонИт": "звОнит",
    "кАшлянуть": "кашлянУть",
    "клАла": "клАла",
    "клЕить": "клеИть",
    "крАлась": "крАлась",
    "кровоточИть": "кровотОчить",
    "лгалА": "лгАла",
    "лилА": "лИла",
    "лилАсь": "лИлась",
    "навралА": "наврАла",
    "наделИт": "надЕлит",
    "надорвалАсь": "надорвАлась",
    "назвалАсь": "назвАлась",
    "накренИтся": "накрЕнится",
    "налилА": "налИла",
    "нарвалА": "нарвАла",
    "нАчал": "начАл",
    "началА": "нАчала",
    "обзвонИт": "обзвОнит",
    "облегчИт": "облЕгчит",
    "облилАсь": "облИлась",
    "обнялАсь": "обнЯлась",
    "обогналА": "обогнАла",
    "ободралА": "ободрАла",
    "ободрИть": "обОдрить",
    "ободрИться": "обОдриться",
    "обострИть": "обОстрить",
    "одолжИть": "одОлжить",
    "озлОбить": "озлобИть",
    "оклЕить": "Оклеить",
    "окружИт": "окрУжит",
    "опОшлить": "опошлИть",
    "освЕдомится": "осведОмится",
    "отбылА": "Отбыла",
    "отдалА": "Отдала",
    "откУпорить": "откупОрить",
    "отозвалА": "отозвАла",
    "отозвалАсь": "отозвАлась",
    "перезвонИт": "перезвОнит",
    "перелилА": "перелИла",
    "плодоносИть": "плодоносИть",
    "пломбировАть": "пломбирОвать",
    "повторИт": "повтОрит",
    "позвалА": "позвАла",
    "позвонИт": "позвОнит",
    "полилА": "полИла",
    "положИть": "полОжить",
    "понЯть": "пОнять",
    "послАла": "пОслала",
    "прИбыл": "прибЫл",
    "прибылА": "прИбыла",
    "принЯть": "прИнять",
    "рвалА": "рвАла",
    "сверлИт": "свЕрлит",
    "снялА": "снЯла",
    "создалА": "создАла",
    "сорвалА": "сорвАла",
    "убралА": "убрАла",
    "уговОрить": "уговорИть",
    "укрепИт": "укрЕпит",
    "чЕрпать": "черпАть",
    "щЕмит": "щемИт",
    "щёлкать": "щелкАть",
    "балОванный": "бАлованный",
    "включЕнный": "включЕнный",
    "довезЕнный": "довЕзенный",
    "зАгнутый": "загнУтый",
    "зАнятый": "занЯтый",
    "запертА": "зАперта",
    "зАселенный": "заселЕнный",
    "кормЯщий": "кОрмящий",
    "молЯщий": "мОлящий",
    "нанЯвшийся": "нАнявшийся",
    "начАвший": "нАчавший",
    "начАвшись": "нАчавшись",
    "ободрЕнный": "обОдренный",
    "отключЕнный": "отклЮченный",
    "повторЕнный": "повтОренный",
    "поделЕнный": "подЕленный",
    "понЯвший": "пОнявший",
    "приручЕнный": "приручЕнный",
    "прожИвший": "прОживший",
    "включЕн": "вклЮчен",
    "довезЕн": "довЕзен",
    "начАта": "нАчата",
}





# Обработка команды /start
def start(update: Update, context: CallbackContext):
    update.message.reply_text("Привет! Я проверю твои знания ударений. Начнем тест!")
    file_path = r'home/root'  # Используем raw string


    # Отправляем файл
    update.message.reply_document(document=open(file_path, 'rb'))
    # Инициализируем счётчик правильных ответов
    context.user_data['score'] = 0
    # Запускаем первый вопрос
    ask_question(update, context)

def ask_question(update: Update, context: CallbackContext):
    word, wrong_accent = random.choice(list(words.items()))
    correct_answer = word

    # Создание кнопок
    buttons = [
        [InlineKeyboardButton(correct_answer, callback_data="correct")],
        [InlineKeyboardButton(wrong_accent, callback_data="incorrect")]
    ]
    random.shuffle(buttons)  # Перемешиваем варианты

    reply_markup = InlineKeyboardMarkup(buttons)

    # Отправка вопроса
    context.user_data['correct_word'] = correct_answer
    update.message.reply_text(
        f"Выберите правильное ударение в слове: {word.replace('О', 'о').replace('А', 'а').replace('Е', 'е')}",
        reply_markup=reply_markup
    )

# Обработка выбора пользователя
def button(update: Update, context: CallbackContext):
    query = update.callback_query
    user_answer = query.data
    correct_answer = context.user_data['correct_word']

    if user_answer == "correct":
        context.user_data['score'] += 1  # Увеличиваем счётчик при правильном ответе
        query.edit_message_text(text=f"✅ Правильно!\n"
                                      f"Правильные ответы: {context.user_data['score']}")
    else:
        context.user_data['score'] = 0  # Сбрасываем счётчик при неправильном ответе
        query.edit_message_text(text=f"❌ Неправильно. Правильный ответ: {correct_answer}")

    # Запускаем следующий вопрос
    ask_question(query, context)

# Основной блок для запуска бота
def main():
    updater = Updater("", use_context=True)
    dp = updater.dispatcher

    # Команда /start
    dp.add_handler(CommandHandler("start", start))

    # Обработка нажатий на кнопки
    dp.add_handler(CallbackQueryHandler(button))

    # Запуск бота
    updater.start_polling()
    updater.idle()

if __name__ == '__main__':
    main()
